[
  {
    "id": 1,
    "name": "13-inch MacBook Air M1",
    "price": "4899",
    "des": "أنحف وأخف نوت بوك صممته Apple يأتيك بقوة شريحة Apple M1، لتنجز مشاريعك بسرعة فائقة مع وحدة معالجة مركزية ثمانية النوى. كما يتيح لك الارتقاء بالألعاب التي تتطلب أداء رسومات قوياً إلى مستويات جديدة مع وحدة معالجة رسومات غرافيك معزّزة بما يصل إلى 8 نوى، وبفضل المحرك العصبي Neural Engine المزوّد بعدد 16 نواة، يمكنك إنجاز مهام التعلم الآلي على نحو أسرع. وكل هذا بتصميم صامت من دون مراوح مع أطول عمر بطارية على الإطلاق يدوم لغاية 18 ساعة.1 إنه MacBook Air بتصميم سهل الحمل، ولكن بقوة أكبر.",
    "img": "https://raw.githubusercontent.com/2018asma/json/main/MacBook_Air_Blush_PDP_Image_Position-1_AR-1-1536x1536.jpeg",
    "colors": [
      "gold",
      "silver",
      "space gray"
    ],
    "model": [
      "Apple M1 chip with 8-core CPU and 7-core GPU, 256GB",
      "Apple M1 chip with 8-core CPU and 8-core GPU, 512GB"
    ]
  },
  {
    "id": 2,
    "name": "13-inch MacBook Pro M1",
    "price": "6299",
    "des": "تغير أداء جهاز MacBook Pro مقاس 13 إنش جذرياً مع شريحة Apple M1‏، وذلك بفضل وحدة معالجة مركزية ثمانية النوى تنجز المهام المعقدة في مجال التصوير والبرمجة وتعديل الفيديوهات وغيرها الكثير بسرعة البرق. كما يأتي الجهاز مزوداً بوحدة معالجة رسومات غرافيك ثمانية النوى تنجز المهام التي تتطلب أداء رسومات قوياً بسرعة مذهلة وتسمح بتشغيل الألعاب بسلاسة فائقة، فضلاً عن ‏المحرك العصبي Engine‏ ‏Neural مع 16 نواة لتعلم آلي أكثر قوة في تطبيقاتك المفضلة. ويمتاز هذا الجهاز أيضاً بذاكرة موحدة فائقة السرعة لأداء في غاية السلاسة، وأطول عمر بطارية في Mac يصل لغاية 20 ساعة.2 إنه جهاز نوت بوك الاحترافي الأكثر شهرة من تصميم Apple، بأداء واحترافية لم تعهدهما من قبل.",
    "img": "https://raw.githubusercontent.com/2018asma/json/main/MacBook_Pro_Space_Gray_PDP_Image_Position-1_AR-1-1536x1536.jpeg",
    "colors": [
      "silver",
      "space gray"
    ],
    "model": [
      "Apple M1 chip with 8‑core CPU and 8‑core GPU, 256GB SSD",
      "Apple M1 chip with 8‑core CPU and 8‑core GPU, 512GB SSD"
    ]
  }
]